# Taps
tap "homebrew/cask-fonts"

# Core dependencies
brew "stow"

# Terminal and shell tools
cask "wezterm"
cask "font-meslo-lg-nerd-font"
brew "starship"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "eza"
brew "tmux"

# Development tools
brew "neovim"
brew "git"
brew "fd"
brew "gh"
brew "lua"
brew "go"
brew "ripgrep"
brew "bat"
brew "htop"
brew "fzf"
brew "wget"
brew "1password-cli"

# Json
brew "jq"
