# Taps
tap "charmbracelet/tap" # for skate

# Apps
cask "font-meslo-lg-nerd-font"
cask "font-commit-mono-nerd-font" # Jetbrains Mono already comes with wezterm
cask "wezterm"
cask "spotify"
cask "google-chrome"
cask "1password"
cask "1password-cli"
cask "slack"
cask "notion"
# cask "cursor"

# Terminal and shell tools
# brew "starship"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "stow"
brew "eza"
brew "tmux"
brew "powerlevel10k"
brew "charmbracelet/tap/skate" # local kv store

# Development tools
brew "neovim"
brew "git"
brew "fd"
brew "gh"
brew "lua"
brew "go"
brew "node"
brew "oven-sh/bun/bun" # like the js bun
brew "ripgrep"
brew "bat"
brew "htop"
brew "fzf"
brew "wget"
brew "ollama"
brew "jq"

